micropython/micropython/ports/cc3200/hal/inc/hw_hib1p2.h
//*****************************************************************************
//
//  Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#ifndef __HW_HIB1P2_H__
#define __HW_HIB1P2_H__

//*****************************************************************************
//
// The following are defines for the HIB1P2 register offsets.
//
//*****************************************************************************
#define HIB1P2_O_SRAM_SKA_LDO_PARAMETERS0 \
                                0x00000000

#define HIB1P2_O_SRAM_SKA_LDO_PARAMETERS1 \
                                0x00000004

#define HIB1P2_O_DIG_DCDC_PARAMETERS0 \
                                0x00000008

#define HIB1P2_O_DIG_DCDC_PARAMETERS1 \
                                0x0000000C

#define HIB1P2_O_DIG_DCDC_PARAMETERS2 \
                                0x00000010

#define HIB1P2_O_DIG_DCDC_PARAMETERS3 \
                                0x00000014

#define HIB1P2_O_DIG_DCDC_PARAMETERS4 \
                                0x00000018

#define HIB1P2_O_DIG_DCDC_PARAMETERS5 \
                                0x0000001C

#define HIB1P2_O_DIG_DCDC_PARAMETERS6 \
                                0x00000020

#define HIB1P2_O_ANA_DCDC_PARAMETERS0 \
                                0x00000024

#define HIB1P2_O_ANA_DCDC_PARAMETERS1 \
                                0x00000028

#define HIB1P2_O_ANA_DCDC_PARAMETERS16 \
                                0x00000064

#define HIB1P2_O_ANA_DCDC_PARAMETERS17 \
                                0x00000068

#define HIB1P2_O_ANA_DCDC_PARAMETERS18 \
                                0x0000006C

#define HIB1P2_O_ANA_DCDC_PARAMETERS19 \
                                0x00000070

#define HIB1P2_O_FLASH_DCDC_PARAMETERS0 \
                                0x00000074

#define HIB1P2_O_FLASH_DCDC_PARAMETERS1 \
                                0x00000078

#define HIB1P2_O_FLASH_DCDC_PARAMETERS2 \
                                0x0000007C

#define HIB1P2_O_FLASH_DCDC_PARAMETERS3 \
                                0x00000080

#define HIB1P2_O_FLASH_DCDC_PARAMETERS4 \
                                0x00000084

#define HIB1P2_O_FLASH_DCDC_PARAMETERS5 \
                                0x00000088

#define HIB1P2_O_FLASH_DCDC_PARAMETERS6 \
                                0x0000008C

#define HIB1P2_O_PMBIST_PARAMETERS0 \
                                0x00000094

#define HIB1P2_O_PMBIST_PARAMETERS1 \
                                0x00000098

#define HIB1P2_O_PMBIST_PARAMETERS2 \
                                0x0000009C

#define HIB1P2_O_PMBIST_PARAMETERS3 \
                                0x000000A0

#define HIB1P2_O_FLASH_DCDC_PARAMETERS8 \
                                0x000000A4

#define HIB1P2_O_ANA_DCDC_PARAMETERS_OVERRIDE \
                                0x000000A8

#define HIB1P2_O_FLASH_DCDC_PARAMETERS_OVERRIDE \
                                0x000000AC

#define HIB1P2_O_DIG_DCDC_VTRIM_CFG \
                                0x000000B0

#define HIB1P2_O_DIG_DCDC_FSM_PARAMETERS \
                                0x000000B4

#define HIB1P2_O_ANA_DCDC_FSM_PARAMETERS \
                                0x000000B8

#define HIB1P2_O_SRAM_SKA_LDO_FSM_PARAMETERS \
                                0x000000BC

#define HIB1P2_O_BGAP_DUTY_CYCLING_EXIT_CFG \
                                0x000000C0

#define HIB1P2_O_CM_OSC_16M_CONFIG \
                                0x000000C4

#define HIB1P2_O_SOP_SENSE_VALUE \
                                0x000000C8

#define HIB1P2_O_HIB_RTC_TIMER_LSW_1P2 \
                                0x000000CC

#define HIB1P2_O_HIB_RTC_TIMER_MSW_1P2 \
                                0x000000D0

#define HIB1P2_O_HIB1P2_BGAP_TRIM_OVERRIDES \
                                0x000000D4

#define HIB1P2_O_HIB1P2_EFUSE_READ_REG0 \
                                0x000000D8

#define HIB1P2_O_HIB1P2_EFUSE_READ_REG1 \
                                0x000000DC

#define HIB1P2_O_HIB1P2_POR_TEST_CTRL \
                                0x000000E0

#define HIB1P2_O_HIB_TIMER_SYNC_CALIB_CFG0 \
                                0x000000E4

#define HIB1P2_O_HIB_TIMER_SYNC_CALIB_CFG1 \
                                0x000000E8

#define HIB1P2_O_HIB_TIMER_SYNC_CFG2 \
                                0x000000EC

#define HIB1P2_O_HIB_TIMER_SYNC_TSF_ADJ_VAL \
                                0x000000F0

#define HIB1P2_O_HIB_TIMER_RTC_GTS_TIMESTAMP_LSW \
                                0x000000F4

#define HIB1P2_O_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW \
                                0x000000F8

#define HIB1P2_O_HIB_TIMER_RTC_WUP_TIMESTAMP_LSW \
                                0x000000FC

#define HIB1P2_O_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW \
                                0x00000100

#define HIB1P2_O_HIB_TIMER_SYNC_WAKE_OFFSET_ERR \
                                0x00000104

