micropython/micropython/ports/cc3200/hal/inc/hw_hib1p2.h
#define HIB1P2_MEM_DIG_DCDC_CLK_CONFIG_MEM_DIG_DCDC_CLK_PLLGEN_ON_TIME_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_ANA_DCDC_CLK_CONFIG register.
//
//******************************************************************************
#define HIB1P2_MEM_ANA_DCDC_CLK_CONFIG_MEM_ANA_DCDC_CLK_ENABLE \
                                0x00000100

#define HIB1P2_MEM_ANA_DCDC_CLK_CONFIG_MEM_ANA_DCDC_CLK_PLLGEN_OFF_TIME_M \
                                0x000000F0

#define HIB1P2_MEM_ANA_DCDC_CLK_CONFIG_MEM_ANA_DCDC_CLK_PLLGEN_OFF_TIME_S 4
#define HIB1P2_MEM_ANA_DCDC_CLK_CONFIG_MEM_ANA_DCDC_CLK_PLLGEN_ON_TIME_M \
                                0x0000000F

#define HIB1P2_MEM_ANA_DCDC_CLK_CONFIG_MEM_ANA_DCDC_CLK_PLLGEN_ON_TIME_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_FLASH_DCDC_CLK_CONFIG register.
//
//******************************************************************************
#define HIB1P2_MEM_FLASH_DCDC_CLK_CONFIG_MEM_FLASH_DCDC_CLK_ENABLE \
                                0x00000100

#define HIB1P2_MEM_FLASH_DCDC_CLK_CONFIG_MEM_FLASH_DCDC_CLK_PLLGEN_OFF_TIME_M \
                                0x000000F0

#define HIB1P2_MEM_FLASH_DCDC_CLK_CONFIG_MEM_FLASH_DCDC_CLK_PLLGEN_OFF_TIME_S 4
#define HIB1P2_MEM_FLASH_DCDC_CLK_CONFIG_MEM_FLASH_DCDC_CLK_PLLGEN_ON_TIME_M \
                                0x0000000F

#define HIB1P2_MEM_FLASH_DCDC_CLK_CONFIG_MEM_FLASH_DCDC_CLK_PLLGEN_ON_TIME_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_PA_DCDC_CLK_CONFIG register.
//
//******************************************************************************
#define HIB1P2_MEM_PA_DCDC_CLK_CONFIG_MEM_PA_DCDC_CLK_ENABLE \
                                0x00000100

#define HIB1P2_MEM_PA_DCDC_CLK_CONFIG_MEM_PA_DCDC_CLK_PLLGEN_OFF_TIME_M \
                                0x000000F0

#define HIB1P2_MEM_PA_DCDC_CLK_CONFIG_MEM_PA_DCDC_CLK_PLLGEN_OFF_TIME_S 4
#define HIB1P2_MEM_PA_DCDC_CLK_CONFIG_MEM_PA_DCDC_CLK_PLLGEN_ON_TIME_M \
                                0x0000000F

#define HIB1P2_MEM_PA_DCDC_CLK_CONFIG_MEM_PA_DCDC_CLK_PLLGEN_ON_TIME_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_SLDO_VNWA_OVERRIDE register.
//
//******************************************************************************
#define HIB1P2_MEM_SLDO_VNWA_OVERRIDE_MEM_SLDO_EN_TOP_VNWA_OVERRIDE_CTRL \
                                0x00000002

#define HIB1P2_MEM_SLDO_VNWA_OVERRIDE_MEM_SLDO_EN_TOP_VNWA_OVERRIDE \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE register.
//
//******************************************************************************
#define HIB1P2_MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE_MEM_BGAP_DUTY_CYCLING_OVERRIDE_CTRL \
                                0x00000002

#define HIB1P2_MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE_MEM_BGAP_DUTY_CYCLING_OVERRIDE \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_HIB_FSM_DEBUG register.
//
//******************************************************************************
#define HIB1P2_MEM_HIB_FSM_DEBUG_SRAM_PS_M \
                                0x00000700

#define HIB1P2_MEM_HIB_FSM_DEBUG_SRAM_PS_S 8
#define HIB1P2_MEM_HIB_FSM_DEBUG_ANA_DCDC_PS_M \
                                0x000000F0

#define HIB1P2_MEM_HIB_FSM_DEBUG_ANA_DCDC_PS_S 4
#define HIB1P2_MEM_HIB_FSM_DEBUG_DIG_DCDC_PS_M \
                                0x0000000F

#define HIB1P2_MEM_HIB_FSM_DEBUG_DIG_DCDC_PS_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_SLDO_VNWA_SW_CTRL register.
//
//******************************************************************************
#define HIB1P2_MEM_SLDO_VNWA_SW_CTRL_MEM_SLDO_VNWA_SW_CTRL_M \
                                0x000FFFFF

#define HIB1P2_MEM_SLDO_VNWA_SW_CTRL_MEM_SLDO_VNWA_SW_CTRL_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_SLDO_WEAK_PROCESS register.
//
//******************************************************************************
#define HIB1P2_MEM_SLDO_WEAK_PROCESS_MEM_SLDO_WEAK_PROCESS \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_PA_DCDC_OV_UV_STATUS register.
//
//******************************************************************************
#define HIB1P2_MEM_PA_DCDC_OV_UV_STATUS_dcdc_pa_ov_prot_out_lowv \
                                0x00000002

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_CM_TEST_MODE register.
//
//******************************************************************************
#define HIB1P2_MEM_CM_TEST_MODE_mem_cm_test_mode \
                                0x00000001




#endif // __HW_HIB1P2_H__
